# Напишите код, который принимает имя пользователя и печатает фразу состоящую из слов "Привет",
# запятой, имени пользователя и восклицательного знака.
# Пример ввода
# Вася
# Пример вывода
# Привет, Вася!

name = input("Введите Ваше имя: ")
print(f"Привет, {name}!")
