# Напишите код, который принимает значения основания и высоты прямоугольного треугольника и
# печатает его площадь. Каждое число принимается на отдельной строке
# Пример ввода
# 3
# 5
# Пример вывода
# 7.5

basis = int(input("Основания прямоугольного треугольника = "))
height = int(input("Высота прямоугольного треугольника = "))
print(f"Площадь прямоугольного треугольника = {basis * height}")
