# Школа решила заменить столы в трех классах. За каждым столом сидят два ученика. Учитывая
# количество учеников в каждом классе, напечатайте минимально возможное количество столов,
# которые нужно приобрести.
# Программа должна принять три целых числа: количество учащихся в каждом из трех классов, a, b и c
# соответственно.
# На пример, в первом классе 20 учеников и, следовательно, класс нуждается в 10 столах. Второй класс
# состоит из 21 ученика, поэтому им нужно не менее, чем 11 столов. 11 столов также достаточно для
# третьего класса из 22 учеников. Так что нам нужно всего 32 стола.
# Пример ввода
# 20
# 21
# 22
# Пример вывода
# 32

class_a = int(input("Ввведите количество учеников в 'А' классе: "))
class_b = int(input("Ввведите количество учеников в 'Б' классе: "))
class_c = int(input("Ввведите количество учеников в 'В' классе: "))
table = class_a + class_b + class_c
if table % 2 == 0:
    print(f"Нужно столов: {int(table / 2)} шт.")
else:
    print(f"Нужно столов: {int((table + 1) / 2)} шт.")
