# Напишите код, который принимает три целых числа и печатает их сумму. Каждое число принимается
# на отдельной строке.
# Пример ввода
# 1
# 2
# 3
# Пример вывода
# 6

number1 = int(input("Введите число: "))
number2 = int(input("Введите число: "))
number3 = int(input("Введите число: "))
print(f"Сумма чисел = {number1 + number2 + number3}")
